// Жадный алгоритм (Данцига) для ЗоР
// Л.р. №9

#include <iostream>
#include <fstream>
#include <string>

using namespace std;

int main()
{
	setlocale(LC_ALL, "Russian");
	srand(static_cast<unsigned int>(time(0)));

	int N;                  // число предметов
	float Wmax;            // максимальный вес
	float S[20];          // получаемый набор предметов, если положен, то s[i]=1
	float c[20];         // ценность предметов
	float w[20];        // вес предметов
	float Q = 0;       // суммарная ценность всех предметов в ранце
	float W = 0;      // суммарный вес, положенных предметов
	int i, j = 0;
	float check = 0; // для проверки существования задачи
	float y[20];    // удельная стоимость

	/*int m;*/

	//cout << "выберите способ ввода данных " << endl;
	//cout << "1-генерируем случайно; 2-считываем из файла" << endl;
	//cin >> m;

	//switch (m)
	//{
	//case 1:
	//	cout << "Введите количество предметов " << endl;
	//	cin >> N;
	//	cout << endl;

	//	for (i = 0; i < N; ++i)
	//	{
	//		cout << "Предмет: " << i << '\t';
	//		S[i] = 0;
	//		c[i] = rand() % (15 - 2) + 1;
	//		cout << '\t'<< "Ценность: " << c[i] << '\t';
	//		w[i] = rand() % (15 - 2) + 1;
	//		cout << '\t'<< "Вес: " << w[i] << '\t';
	//		y[i] = c[i] / w[i];
	//		cout << '\t'<<"Удельная ценность: " << y[i] << '\t' << endl;
	//	}
	//	cout << endl;

	//	//////////////////////////////////////////////////

	//	for (int i = 1; i < N; ++i)
	//	{
	//		for (int j = 0; j < N - i; j++)
	//		{
	//			if (y[j] < y[j + 1])        // Сортируем по убыванию УДЕЛЬНОЙ ценности предметов
	//			{
	//				float temp2 = y[j];      // Обмен местами удельная ценность
	//				y[j] = y[j + 1];
	//				y[j + 1] = temp2;

	//				float temp = c[j];        // Обмен местами цена
	//				c[j] = c[j + 1];
	//				c[j + 1] = temp;

	//				float temp1 = w[j];      // Обмен местами вес
	//				w[j] = w[j + 1];
	//				w[j + 1] = temp1;

	//			}
	//		}
	//	}

	//	cout << endl << "Отсортированные данные: " << endl;
	//	for (int i = 0; i < N; ++i)
	//	{
	//		cout << "Предмет: " << i << '\t';
	//		cout << '\t'<< "Ценность: " << c[i] << '\t';
	//		cout << '\t'<< "Вес: " << w[i] << '\t';
	//		cout << '\t'<<"Удельная ценность: " << y[i] << '\t' << endl;
	//	}

	//	cout << endl;

	//	cout << endl << "Введите вместимость ранца " << endl;
	//	cin >> Wmax;

	//	for (i = 0; i < N; ++i)
	//	{
	//		check = check + w[i];
	//	}
	//	cout << endl << "Суммарный вес всех предметов: " << check << endl;

	//	///////////////////////////////////////////

	//	if (check > Wmax)
	//	{

	//		while (W < Wmax)
	//		{
	//			for (i = 0; i < N; ++i)
	//			{
	//				if ((W + w[i]) <= Wmax)
	//				{
	//					cout << endl << "i: " << i << endl;
	//					W = W + w[i];
	//					Q = Q + c[i];
	//					S[i] = 1;
	//					cout << "Предмет положен в рюкзак! " << endl;
	//					cout << "Предмет: " << i << ' ';
	//					cout << ' '<<"Вес: " << w[i] << ' ';
	//					cout << ' '<< "Цена: " << c[i] << ' ';
	//					cout << ' '<<"Удельная цена: " << y[i] << ' ';
	//					cout << ' '<<"Текущая цена ранца: " << Q << ' ';
	//					cout << ' '<<"Текущий вес ранца: " << W << endl;
	//				}

	//				else
	//				{
	//					cout << endl << "i: " << i << endl;
	//					cout << "Предмет: " << i << ' ' << "Вес: " << w[i] << ' ' << "Цена: " << c[i] << ' ' << "Удельная цена: " << y[i] << endl;
	//					cout << "Предмет в рюкзак не вошел, текущие цена и вес ранца не изменились!" << endl;
	//				}
	//			}
	//			break;
	//		}

	//		cout << endl << "-----------------------------------------" << endl;
	//		cout << "Ответ: " << endl;
	//		cout << endl;

	//		for (int i = 0; i < N; i++)
	//		{
	//			if (S[i] == 1)
	//			{
	//				cout << "Предмет: " << i << '\t';
	//				cout << '\t'<< "Вес: " << w[i] << '\t';
	//				cout << '\t'<<"Цена: " << c[i] << '\t';
	//				cout << '\t'<<"Удельная цена: " << y[i];
	//				cout << endl;
	//			}
	//		}

	//		cout << endl;
	//		cout << "Итоговая цена ранца: " << Q << endl;
	//		cout << "Итоговый вес ранца: " << W << endl;
	//		cout << "-----------------------------------------" << endl;

	//	}
	//	else cout << "Задача не существует, все предметы убираются!" << endl;      // когда check<=Wmax

	/*case 2:
	{*/
		float mass1[20][20];
		ifstream input("file.txt");
		float ch;
		int Count = 0;
		while (input >> ch)
		Count++;
		/*cout << "Чисел в файле : " << Count << endl;*/
		input.close();

		float* mass = new float[Count];
		ifstream file("file.txt");
		for (int i = 0; i < Count; i++) {
			file >> mass[i];
			/*cout << mass[i] << ' ';*/
		}
		cout << endl;
		int length = 0;
		length = Count / 4;     // всегда 4 строки: номер, цена, вес, удельная цена

		///////////////////////////////////////////
		for (int x = 0; x < 4; ++x)                     // загнали в один массив двумерный
		{
			for (int k = 0; k < length; ++k)
			{
				mass1[x][k] = mass[x * length + k];
				/*cout << mass1[x][k] << " ";*/
			}
			/*cout << endl;*/
		}
		
		////////////////////////////

		// а теперь разделим его 

		for (int k = 0; k < length; ++k)
		{
			cout << "Предмет: " << k;
			S[k] = 0;
			c[k] = mass1[1][k];
			cout << '\t' << "Цена: " << c[k] << '\t';
			w[k] = mass1[2][k];
			cout << '\t' << "Вес: " << w[k] << '\t';
			y[k] = mass1[3][k];
			cout << '\t' << "Удельная цена: " << y[k] << endl;
		}

		//////////////////////////////////////////////////

		for (int k = 1; k < length; ++k)
		{
			for (int j = 0; j < length - k; j++)
			{
				if (y[j] < y[j + 1])              // Сортируем по убыванию УДЕЛЬНОЙ ценности предметов
				{
					float temp2 = y[j];          // Обмен местами удельная ценность
					y[j] = y[j + 1];
					y[j + 1] = temp2;

					float temp = c[j];         // Обмен местами цена
					c[j] = c[j + 1];
					c[j + 1] = temp;

					float temp1 = w[j];      // Обмен местами вес
					w[j] = w[j + 1];
					w[j + 1] = temp1;

				}
			}
		}

		cout << endl << "Отсортированные данные: " << endl;
		for (int k = 0; k < length; ++k)
		{
			cout << "Предмет: " << k << '\t';
			cout << '\t' << "Ценность: " << c[k] << '\t';
			cout << '\t' << "Вес: " << w[k] << '\t';
			cout << '\t' << "Удельная ценность: " << y[k] << '\t' << endl;
		}

		cout << endl;

		cout << endl << "Введите вместимость ранца " << endl;
		cin >> Wmax;

		for (int k = 0; k < length; ++k)
		{
			check = check + w[k];
		}
		cout << endl << "Суммарный вес всех предметов: " << check << endl;

		///////////////////////////////////////////

		if (check > Wmax)
		{

			while (W < Wmax)
			{
				for (int k = 0; k < length; ++k)
				{
					if ((W + w[k]) <= Wmax)
					{
						cout << endl << "i: " << k << endl;
						W = W + w[k];
						Q = Q + c[k];
						S[k] = 1;
						cout << "Предмет положен в рюкзак! " << endl;
						cout << "Предмет: " << k << ' ';
						cout << ' ' << "Вес: " << w[k] << ' ';
						cout << ' ' << "Цена: " << c[k] << ' ';
						cout << ' ' << "Удельная цена: " << y[k] << ' ';
						cout << ' ' << "Текущая цена ранца: " << Q << ' ';
						cout << ' ' << "Текущий вес ранца: " << W << endl;
					}

					else
					{
						cout << endl << "i: " << k << endl;
						cout << "Предмет: " << k << ' ' << ' ' << "Вес: " << w[k] << ' ' << ' ' << "Цена: " << c[k] << ' ' << ' ' << "Удельная цена: " << y[k] << endl;
						cout << "Предмет в рюкзак не вошел, текущие цена и вес ранца не изменились!" << endl;
					}
				}
				break;
			}

			cout << endl << "-----------------------------------------" << endl;
			cout << "Ответ: " << endl;
			cout << endl;

			for (int k = 0; k < length; k++)
			{
				if (S[k] == 1)
				{
					cout << "Предмет: " << k << '\t';
					cout << '\t' << "Вес: " << w[k] << '\t';
					cout << '\t' << "Цена: " << c[k] << '\t';
					cout << '\t' << "Удельная цена: " << y[k];
					cout << endl;
				}
			}

			cout << endl;
			cout << "Итоговая цена ранца: " << Q << endl;
			cout << "Итоговый вес ранца: " << W << endl;
			cout << "-----------------------------------------" << endl;

		}
		else cout << "Задача не существует, все предметы убираются!" << endl;      // когда check<=Wmax

	/*}*/

	/*}*/
}